app/controllers/microposts_controller.rb

INSERT INTO "microposts" ("content", "user_id", "created_at", "updated_at", "picture") VALUES (?, ?, ?, ?, ?)  [["content", "Dumbo"], ["user_id", 1], ["created_at", "2019-12-13 21:42:27.450048"], ["updated_at", "2019-12-13 21:42:27.450048"], ["picture", "gnome.png"]]
---
  def create
    @micropost = current_user.microposts.build(micropost_params)
    if @micropost.save

DELETE FROM "microposts" WHERE "microposts"."id" = ?  [["id", 303]]
---
  def destroy
    @micropost.destroy

SELECT "microposts".* FROM "microposts" WHERE "microposts"."user_id" = ? AND "microposts"."id" = ? ORDER BY "microposts"."created_at" DESC LIMIT ?  [["user_id", 1], ["id", 303], ["LIMIT", 1]]
---
    def correct_user
      @micropost = current_user.microposts.find_by(id: params[:id])