app/controllers/password_resets_controller.rb

SELECT "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", ""], ["LIMIT", 1]]
---
  def create
    @user = User.find_by(email: params[:password_reset][:email].downcase)

UPDATE "users" SET "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["password_digest", "$2a$12$s5LNz64zNw5RKskNNZPFHuiL./O7.TDXlscqT1YNNEWw217xs428O"], ["updated_at", "2019-12-05 18:43:20.636189"], ["id", 1]]
---
  def update
    if params[:user][:password].empty?
      @user.errors.add(:password, "can't be empty")
      render 'edit'
    elsif @user.update(user_params)

SELECT "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "example@railstutorial.org"], ["LIMIT", 1]]
---
  def retrieve_user
    @user = User.find_by(email: params[:email])